config.el
(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(package-initialize)

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  (setq use-package-always-ensure t
        use-package-expand-minimally t))

(use-package evil
  :ensure t ;; install evil if not installed
  :config
  (setq evil-auto-indent nil)
  (setq evil-ex-sibstitute-global t)
  (setq evil-move-cursot-back nil)
  (setq evil-move-beyong-eol t)
  (setq evil-kill-on-visual-paste nil)
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-integration nil)
  (evil-mode))

(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init
   '(pass
     calendar
     dired
     pdf
     company
     vterm
     flycheck
     xref
     eshell
     org
     magit
     git-timemachine)))

(add-to-list 'load-path "~/.config/haskmacs/evil-commentary")
(require 'evil-commentary)
(evil-commentary-mode)

(use-package evil-surround
  :after evil
  :config
  (global-evil-surround-mode 1))

(use-package evil-quickscope
  :after evil
  :config
  :hook ((prog-mode . turn-on-evil-quickscope-mode)
	 (LaTeX-mode . turn-on-evil-quickscope-mode)
	 (org-mode . turn-on-evil-quickscope-mode)))

(use-package evil-lion
  :ensure t
  :init
  (evil-lion-mode))

(winner-mode 1)

(setq-default message-log-max nil)

(add-hook 'minibuffer-exit-hook
      '(lambda ()
         (let ((buffer "*Completions*"))
           (and (get-buffer buffer)
            (kill-buffer buffer)))))

(setq-default warning-minimum-level nil)
(setq make-backup-files nil)

(use-package general
  :ensure t
  :config
  (general-evil-setup t))


(defun +evil--window-swap (direction)
  "Move current window to the next window in DIRECTION.
If there are no windows there and there is only one window, split in that
direction and place this window there. If there are no windows and this isn't
the only window, use evil-window-move-* (e.g. `evil-window-move-far-left')."
  (when (window-dedicated-p)
    (user-error "Cannot swap a dedicated window"))
  (let* ((this-window (selected-window))
         (this-buffer (current-buffer))
         (that-window (windmove-find-other-window direction nil this-window))
         (that-buffer (window-buffer that-window)))
    (when (or (minibufferp that-buffer)
              (window-dedicated-p this-window))
      (setq that-buffer nil that-window nil))
    (if (not (or that-window (one-window-p t)))
        (funcall (pcase direction
                   ('left  #'evil-window-move-far-left)
                   ('right #'evil-window-move-far-right)
                   ('up    #'evil-window-move-very-top)
                   ('down  #'evil-window-move-very-bottom)))
      (unless that-window
        (setq that-window
              (split-window this-window nil
                            (pcase direction
                              ('up 'above)
                              ('down 'below)
                              (_ direction))))
        (with-selected-window that-window
          (switch-to-buffer (doom-fallback-buffer)))
        (setq that-buffer (window-buffer that-window)))
      (window-swap-states this-window that-window)
      (select-window that-window))))

(defun +evil/window-move-left ()
  "Swap windows to the left."
  (interactive) (+evil--window-swap 'left))
;;;###autoload
(defun +evil/window-move-right ()
  "Swap windows to the right"
  (interactive) (+evil--window-swap 'right))
;;;###autoload
(defun +evil/window-move-up ()
  "Swap windows upward."
  (interactive) (+evil--window-swap 'up))
;;;###autoload
(defun +evil/window-move-down ()
  "Swap windows downward."
  (interactive) (+evil--window-swap 'down))

(defun doom/window-maximize-buffer (&optional arg)
  "Close other windows to focus on this one.
Use `winner-undo' to undo this. Alternatively, use `doom/window-enlargen'."
  (interactive "P")
  (when (and (bound-and-true-p +popup-mode)
             (+popup-window-p))
    (+popup/raise (selected-window)))
  (delete-other-windows))

(defvar winner-undone-data  nil) ; There confs have been passed.

(defun winner-undo ()
  "Switch back to an earlier window configuration saved by Winner mode.
In other words, \"undo\" changes in window configuration."
  (interactive)
  (cond
   ((not winner-mode) (error "Winner mode is turned off"))
   (t (unless (and (eq last-command 'winner-undo)
 		   (eq winner-undo-frame (selected-frame)))
	(winner-save-conditionally)     ; current configuration->stack
 	(setq winner-undo-frame (selected-frame))
 	(setq winner-point-alist (winner-make-point-alist))
 	(setq winner-pending-undo-ring (winner-ring (selected-frame)))
 	(setq winner-undo-counter 0)
 	(setq winner-undone-data (list (winner-win-data))))
      (cl-incf winner-undo-counter)	; starting at 1
      (when (and (winner-undo-this)
 		 (not (window-minibuffer-p)))
 	(message "Winner undo (%d / %d)"
 		 winner-undo-counter
 		 (1- (ring-length winner-pending-undo-ring)))))))



(nvmap :prefix "SPC"
       "." '(find-file :which-key "Find file")
       ":" '(execute-extended-command :which-key "M-x")

       ;; Buffers
       "b b" '(ibuffer :which-key "Ibufer")
       ","   '(persp-switch-to-buffer :which-key "Show buffers")
       "b k" '(kill-current-buffer :which-key "Kill current buffer")
       "b ]" '(next-buffer :which-key "Next buffer")
       "b [" '(previous-buffer :which-key "Previous buffer")
       "b B" '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
       "b K" '(kill-buffer :which-key "kill all buffers")

       ;; Eshell
       "e h" '(counsel-esh-history :which-key "Eshell history")
       "e s" '(eshell :which-key "Eshell")
       "f r" '(counsel-recentf :which-key "Recent files")
       "h r r" '((lambda () (interactive) (load-file "~/.config/my-emacs/init.el")) :which-key "Reload emacs config")
       "t t" '(toggle-truncate-lines :which-key "Toggle truncate lines")

       ;; Window splits
       "w d" '(evil-window-delete :which-key "Close window")
       "w n" '(evil-window-new :which-key "New window")
       "w s" '(evil-window-split :which-key "Horizontal split window")
       "w v" '(evil-window vsplit :which-key "Vertical split window")

       ;; Window motions
       "w h" '(evil-window-left :which-key "Window left")
       "w l" '(evil-window-right :which-key "Window right")
       "w k" '(evil-window-up :which-key "Window up")
       "w j" '(evil-widnow-down :which-key "Window down")
       "w w" '(evil-window-next :which-key "Next Window")
       "w H" '(+evil/window-move-left :which-key "Move window to left")
       "w L" '(+evil/window-move-right :which-key "Move window to right")
       "w J" '(+evil/window-move-down :which-key "Move window to down")
       "w K" '(+evil/window-move-up :which-key "Move window to up")

       ;; Window size

       "w m m" '(doom/window-maximize-buffer :which-key "Full screen window")
       "w u" '(winner-undo :whic-key "Revert back to the last window state")

       ;; Company-mode

       ;; Magit

       "g g" '(magit-status :which-key "Magit status")

       ;; Haskell-mode
       "o r" '(haskell-session-change :which-key "Open Haskell REPL")

       ;; Terminal
       "o t" '(vterm :which-key "Open vterm")
       )

;; (nvmap
;;        "-SPC" '(+company/complete :which-key "bring up the pop up menu for autocomplete"))
