config.org
** macOS keybidings
#+begin_src emacs-lisp
(setq mac-option-key-is-meta t
      mac-command-key-is-meta nil
      mac-command-modifier 'none
      mac-option-modifier 'meta)
#+end_src
* OS packages
** osx-lib
#+begin_src emacs-lisp emacs-lisp
(use-package osx-lib
  :ensure t)
#+end_src
** osx-plist
#+begin_src emacs-lisp
(use-package osx-plist
  :ensure t)
#+end_src
** Prevent Emacs from closing
#+begin_src emacs-lisp
(setq confirm-kill-emacs 'y-or-n-p)
#+end_src

* UI
** Theme
#+begin_src emacs-lisp
(add-to-list 'custom-theme-load-path (expand-file-name "~/.config/haskmacs/themes/"))
;; (load-theme 'nord t)
#+end_src

#+begin_src emacs-lisp
(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode))

#+end_src
** Font
#+begin_src emacs-lisp
(set-face-attribute 'default nil'
                    :font "Andale Mono 14"
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "Andale Mono 14"
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "Andale Mono 14"
                    :weight 'medium)
;; needed for emacsclient
(add-to-list 'default-frame-alist '(font . "Andale Mono 14"))
#+end_src

** Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))
#+end_src

** Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :ensure t
  :init
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "It's good to have an end to journey toward; but it's the journey that matters in the end.")
  (setq dashboard-startup-banner "~/.config/haskmacs/images/lambda.png")
  (setq dashboard-center-content t)
  (setq dashboard-items '((recents . 10)
                          (agenda . 5)
                          (bookmarks . 5)
                          (projects . 5)
                          (registers . 5)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))

#+end_src
* GUI settings
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
;; (setq fancy-splash-image "~/.config/my-emacs/images/lambda.png")

;; for emacs 29
;; (setq frame-resize-pixelwise t)
;; (add-to-list 'default-frame-alist '(undecorated . t))
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
(setq display-line-numbers-type 'relative)
#+end_src

* Org-mode
** Improving upon org-mode
*** Org-mode
#+begin_src emacs-lisp
(use-package org
  :ensure t
  :defer t
  :init
  (setq org-directory (expand-file-name "~/Journal"))
  (unless (file-exists-p org-directory)
    (mkdir org-directory t))
  :config
  (setq org-startup-indented t)
  (setq org-return-follows-link t)
  (setq org-src-tab-acts-natively nil)
  (add-hook 'org-mode-hook 'smartparens-mode)
  (add-hook 'org-agenda-mode-hook
	    (lambda ()
	      (visual-line-mode -1)
	      (toggle-truncate-lines 1)
	      (display-line-numbers-mode 0)))
  (add-hook 'org-mode-hook
	    (lambda ()
	      (rainbow-delimiters-mode -1))))
#+end_src
*** Org-contrib
#+begin_src emacs-lisp
(use-package org-contrib
  :after (org)
  :config
  (require 'ox-extra)
  (ox-extras-activate '(latex-header-blocks ignore-headlines)))
#+end_src
*** Evil-org
#+begin_src emacs-lisp
(use-package evil-org
  :hook (org-mode . evil-org-mode)
  :config
  (add-hook 'evil-org-mode-hook
	    (lambda ()
	      (evil-org-set-key-theme '(navigation insert textobjects additional calendar todo))))
  (add-to-list 'evil-emacs-state-modes 'org-agenda-mode)
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
#+end_src
*** Org-bullets
#+begin_src emacs-lisp
(use-package org-bullets
   :ensure t)

(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src
*** Org-tempo
#+begin_src emacs-lisp
(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("sq" . "src sql")))
#+end_src
** Productivity
*** Org-super-agenda
#+begin_src emacs-lisp
(use-package org-super-agenda
   :ensure t)
#+end_src
*** Org-journal
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/haskmacs/org-journal")
(require 'org-journal)
#+end_src
*** helm-bibtex
#+begin_src emacs-lisp
;; (add-to-list 'load-path "~/.config/haskmacs/helm-bibtex")
;; (autoload 'helm-bibtex "helm-bibtex" "" t)
#+end_src
*** Org-ql
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/haskmacs/org-ql")
(add-to-list 'load-path "~/.config/haskmacs/peg")
(require 'org-ql)
#+end_src
* Which key
#+begin_src emacs-lisp
(use-package which-key
  :ensure t
  :config
  (setq which-key-allow-imprecise-window-fit t)
  :init
  (which-key-mode))

(setq which-key-idle-delay 0.2)
#+end_src
* Tools
** Persp mode
#+begin_src emacs-lisp
(use-package persp-mode
  :ensure t)
#+end_src
** Rainbow delimiters
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/haskmacs/rainbow-delimiters")
(require 'rainbow-delimiters)
(add-hook 'lisp-mode #'rainbow-delimiters-mode)
#+end_src
** Treemacs
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/haskmacs/treemacs")
(require 'treemacs-mode)
#+end_src
** Magit
#+begin_src emacs-lisp
(use-package magit
  :ensure t)
#+end_src
** Eglot
#+begin_src emacs-lisp
(use-package eglot
  :ensure t)
#+end_src
** LSP
#+begin_src emacs-lisp
(use-package lsp-mode
  :ensure t
  :hook (
         (typescript-mode . lsp)
         (json-mode . lsp)
         (haskell-mode . lsp)
         ;;(python-mode . lsp)
         )
  :commands lsp
  :init
  (setq lsp-keymap-prefix nil)
  :config
  (setq lsp-idle-delay 1))
#+end_src
** LSP-UI
#+begin_src emacs-lisp
(use-package lsp-ui
  :ensure t)
#+end_src
** Smartparens
#+begin_src emacs-lisp
(use-package smartparens
  :ensure t
  :init
  (smartparens-global-mode))
#+end_src
** Vertico
#+begin_src emacs-lisp
(use-package vertico
  :ensure t
  :bind (:map vertico-map
            ("C-j" . vertico-next)
            ("C-k" . vertico-previous))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))
#+end_src
** Savehist
#+begin_src emacs-lisp
(use-package savehist
  :ensure t
  :init
  (savehist-mode))
#+end_src
** Company
#+begin_src emacs-lisp

(use-package company
  :ensure t
  :config
  (setq company-idle-delay 0.15)
  (setq company-minimum-prefix-length 2)
  (setq company-show-number t))

(add-hook 'after-init-hook 'global-company-mode)
;;;###autoload
(defun +company-has-completion-p ()
  "Return non-nil if a completion candidate exists at point."
  (when company-mode
    (unless company-candidates-length
      (company-manual-begin))
    (= company-candidates-length 1)))

;;;###autoload
(defun +company/toggle-auto-completion ()
  "Toggle as-you-type code completion."
  (interactive)
  (require 'company)
  (setq company-idle-delay (unless company-idle-delay 0.2))
  (message "Auto completion %s"
           (if company-idle-delay "enabled" "disabled")))

;;;###autoload
(defun +company/complete ()
  "Bring up the completion popup. If only one result, complete it."
  (interactive)
  (require 'company)
  (when (ignore-errors
          (/= (point)
              (cdr (bounds-of-thing-at-point 'symbol))))
    (save-excursion (insert " ")))
  (when (and (company-manual-begin)
             (= company-candidates-length 1))
    (company-complete-common)))

;;;###autoload
(defun +company/dabbrev ()
  "Invokes `company-dabbrev-code' in prog-mode buffers and `company-dabbrev'
everywhere else."
  (interactive)
  (call-interactively
   (if (derived-mode-p 'prog-mode)
       #'company-dabbrev-code
     #'company-dabbrev)))
#+end_src
** Company-Box
#+begin_src emacs-lisp
(use-package company-box
  :ensure t)
#+end_src
** Terminal
*** vterm
#+begin_src emacs-lisp
(use-package vterm
  :ensure t)

(use-package vterm-toggle
  :ensure t)
#+end_src
*** eshell
** Projectile
#+begin_src emacs-lisp
;; (use-package projectile
;;   :ensure t)
#+end_src
** Treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :ensure t)
#+end_src
** Xref
#+begin_src emacs-lisp
(use-package xref
  :ensure t)
#+end_src
** Tab management
#+begin_src emacs-lisp
(setq-default indent-tabs-mode nil)
(setq-default default-tab-width 4)
(setq-default tab-width 4)
(setq-default evil-indent-convert-tabs nil)
(setq-default indent-tabs-mode nil)
(setq-default evil-shift-round nil)
#+end_src
** PDF tools
#+begin_src emacs-lisp
(use-package pdf-tools
  :ensure t)
#+end_src

* Programming Languages
** Haskell
