config.el

(setq mac-option-key-is-meta t
      mac-command-key-is-meta nil
      mac-command-modifier 'none
      mac-option-modifier 'meta)

(use-package osx-lib
  :ensure t)

(use-package osx-plist
  :ensure t)

(setq confirm-kill-emacs 'y-or-n-p)

(add-to-list 'custom-theme-load-path (expand-file-name "~/.config/haskmacs/themes/"))
;; (load-theme 'nord t)

(use-package doom-modeline
  :ensure t
  :init
  (doom-modeline-mode))

(set-face-attribute 'default nil'
                    :font "Andale Mono 14"
                    :weight 'medium)

(set-face-attribute 'variable-pitch nil
                    :font "Andale Mono 14"
                    :weight 'medium)

(set-face-attribute 'fixed-pitch nil
                    :font "Andale Mono 14"
                    :weight 'medium)
;; needed for emacsclient
(add-to-list 'default-frame-alist '(font . "Andale Mono 14"))

(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package dashboard
  :ensure t
  :init
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "It's good to have an end to journey toward; but it's the journey that matters in the end.")
  (setq dashboard-startup-banner "~/.config/haskmacs/images/lambda.png")
  (setq dashboard-center-content t)
  (setq dashboard-items '((recents . 10)
                          (agenda . 5)
                          (bookmarks . 5)
                          (projects . 5)
                          (registers . 5)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))

(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
;; (setq fancy-splash-image "~/.config/my-emacs/images/lambda.png")

;; for emacs 29
;; (setq frame-resize-pixelwise t)
;; (add-to-list 'default-frame-alist '(undecorated . t))
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
(setq display-line-numbers-type 'relative)

(use-package org
  :ensure t
  :defer t
  :init
  (setq org-directory (expand-file-name "~/Journal"))
  (unless (file-exists-p org-directory)
    (mkdir org-directory t))
  :config
  (setq org-startup-indented t)
  (setq org-return-follows-link t)
  (setq org-src-tab-acts-natively nil)
  (add-hook 'org-mode-hook 'smartparens-mode)
  (add-hook 'org-agenda-mode-hook
	    (lambda ()
	      (visual-line-mode -1)
	      (toggle-truncate-lines 1)
	      (display-line-numbers-mode 0)))
  (add-hook 'org-mode-hook
	    (lambda ()
	      (rainbow-delimiters-mode -1))))

(use-package org-contrib
  :after (org)
  :config
  (require 'ox-extra)
  (ox-extras-activate '(latex-header-blocks ignore-headlines)))

(use-package evil-org
  :hook (org-mode . evil-org-mode)
  :config
  (add-hook 'evil-org-mode-hook
	    (lambda ()
	      (evil-org-set-key-theme '(navigation insert textobjects additional calendar todo))))
  (add-to-list 'evil-emacs-state-modes 'org-agenda-mode)
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package org-bullets
   :ensure t)

(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(with-eval-after-load 'org
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("sq" . "src sql")))

(use-package org-super-agenda
   :ensure t)

(add-to-list 'load-path "~/.config/haskmacs/org-journal")
(require 'org-journal)

;; (add-to-list 'load-path "~/.config/haskmacs/helm-bibtex")
;; (autoload 'helm-bibtex "helm-bibtex" "" t)

(add-to-list 'load-path "~/.config/haskmacs/org-ql")
(add-to-list 'load-path "~/.config/haskmacs/peg")
(require 'org-ql)

(use-package which-key
  :ensure t
  :config
  (setq which-key-allow-imprecise-window-fit t)
  :init
  (which-key-mode))

(setq which-key-idle-delay 0.2)

(use-package persp-mode
  :ensure t)

(add-to-list 'load-path "~/.config/haskmacs/rainbow-delimiters")
(require 'rainbow-delimiters)
(add-hook 'lisp-mode #'rainbow-delimiters-mode)

(add-to-list 'load-path "~/.config/haskmacs/treemacs")
(require 'treemacs-mode)

(use-package magit
  :ensure t)

(use-package eglot
  :ensure t)

(use-package lsp-mode
  :ensure t
  :hook (
         (typescript-mode . lsp)
         (json-mode . lsp)
         (haskell-mode . lsp)
         ;;(python-mode . lsp)
         )
  :commands lsp
  :init
  (setq lsp-keymap-prefix nil)
  :config
  (setq lsp-idle-delay 1))

(use-package lsp-ui
  :ensure t)

(use-package smartparens
  :ensure t
  :init
  (smartparens-global-mode))

(use-package vertico
  :ensure t
  :bind (:map vertico-map
            ("C-j" . vertico-next)
            ("C-k" . vertico-previous))
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode))

(use-package savehist
  :ensure t
  :init
  (savehist-mode))

(use-package company
  :ensure t
  :config
  (setq company-idle-delay 0.15)
  (setq company-minimum-prefix-length 2)
  (setq company-show-number t))

(add-hook 'after-init-hook 'global-company-mode)
;;;###autoload
(defun +company-has-completion-p ()
  "Return non-nil if a completion candidate exists at point."
  (when company-mode
    (unless company-candidates-length
      (company-manual-begin))
    (= company-candidates-length 1)))

;;;###autoload
(defun +company/toggle-auto-completion ()
  "Toggle as-you-type code completion."
  (interactive)
  (require 'company)
  (setq company-idle-delay (unless company-idle-delay 0.2))
  (message "Auto completion %s"
           (if company-idle-delay "enabled" "disabled")))

;;;###autoload
(defun +company/complete ()
  "Bring up the completion popup. If only one result, complete it."
  (interactive)
  (require 'company)
  (when (ignore-errors
          (/= (point)
              (cdr (bounds-of-thing-at-point 'symbol))))
    (save-excursion (insert " ")))
  (when (and (company-manual-begin)
             (= company-candidates-length 1))
    (company-complete-common)))

;;;###autoload
(defun +company/dabbrev ()
  "Invokes `company-dabbrev-code' in prog-mode buffers and `company-dabbrev'
everywhere else."
  (interactive)
  (call-interactively
   (if (derived-mode-p 'prog-mode)
       #'company-dabbrev-code
     #'company-dabbrev)))

(use-package company-box
  :ensure t)

(use-package vterm
  :ensure t)

(use-package vterm-toggle
  :ensure t)

;; (use-package projectile
;;   :ensure t)

(use-package treemacs
  :ensure t)

(use-package xref
  :ensure t)

(setq-default indent-tabs-mode nil)
(setq-default default-tab-width 4)
(setq-default tab-width 4)
(setq-default evil-indent-convert-tabs nil)
(setq-default indent-tabs-mode nil)
(setq-default evil-shift-round nil)

(use-package pdf-tools
  :ensure t)
