config.org
*** Haskell-mode
#+begin_src emacs-lisp
(use-package haskell-mode
  :ensure t)

(add-hook 'haskell-mode-hook #'lsp-mode)
(add-hook 'haskell-mode-hook (lambda () (setq evil-auto-indent nil)))
(custom-set-variables '(haskell-stylish-on-save t))

;; (defun dotspacemacs/user-config ()
;;  (with-eval-after-load "haskell-mode"
;;     ;; This changes the evil "O" and "o" keys for haskell-mode to make sure that
;;     ;; indentation is done correctly. See
;;     ;; https://github.com/haskell/haskell-mode/issues/1265#issuecomment-252492026.
;;     (defun haskell-evil-open-above ()
;;       (interactive)
;;       (evil-digit-argument-or-evil-beginning-of-line)
;;       (haskell-indentation-newline-and-indent)
;;       (evil-previous-line)
;;       (haskell-indentation-indent-line)
;;       (evil-append-line nil))

;;     (defun haskell-evil-open-below ()
;;       (interactive)
;;       (evil-append-line nil)
;;       (haskell-indentation-newline-and-indent))

;;     (evil-define-key 'normal haskell-mode-map
;;       "o" 'haskell-evil-open-below
;;       "O" 'haskell-evil-open-above)
;;   )
;; )

#+end_src

*** LSP-Haskell
#+begin_src emacs-lisp
(use-package lsp-haskell
  :ensure t
  :after haskell-mode
  :config
  (setq lsp-haskell-server-path "haskell-language-server-9.4.2\~1.8.0.0"
        lsp-haskell-liquid-on t
        lsp-haskell-fomatting-provider "stylish-haskell"))

(setq haskell-font-lock-symbols t)
#+end_src
*** Ghcid
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/haskmacs/ghcid")
(require 'ghcid)
#+end_src
** C
** Python
#+begin_src emacs-lisp
;; (use-package python-mode
;;   :ensure t)
#+end_src
* Data Serialization
** JSON
#+begin_src emacs-lisp
(use-package json-mode
  :ensure t)
#+end_src
** YAML
#+begin_src emacs-lisp
(use-package yaml-mode
  :ensure t)
#+end_src
** CSV
#+begin_src emacs-lisp
(use-package csv-mode
  :ensure t)
#+end_src

* Markup languages
** Latex mode
#+begin_src emacs-lisp
(use-package tex-mode
  :ensure t)
#+end_src
** Markdown mode
#+begin_src emacs-lisp
(use-package markdown-mode
  :ensure t)
#+end_src
