config.el

(use-package haskell-mode
  :ensure t)

(add-hook 'haskell-mode-hook #'lsp-mode)
(add-hook 'haskell-mode-hook (lambda () (setq evil-auto-indent nil)))
(custom-set-variables '(haskell-stylish-on-save t))

;; (defun dotspacemacs/user-config ()
;;  (with-eval-after-load "haskell-mode"
;;     ;; This changes the evil "O" and "o" keys for haskell-mode to make sure that
;;     ;; indentation is done correctly. See
;;     ;; https://github.com/haskell/haskell-mode/issues/1265#issuecomment-252492026.
;;     (defun haskell-evil-open-above ()
;;       (interactive)
;;       (evil-digit-argument-or-evil-beginning-of-line)
;;       (haskell-indentation-newline-and-indent)
;;       (evil-previous-line)
;;       (haskell-indentation-indent-line)
;;       (evil-append-line nil))

;;     (defun haskell-evil-open-below ()
;;       (interactive)
;;       (evil-append-line nil)
;;       (haskell-indentation-newline-and-indent))

;;     (evil-define-key 'normal haskell-mode-map
;;       "o" 'haskell-evil-open-below
;;       "O" 'haskell-evil-open-above)
;;   )
;; )

(use-package lsp-haskell
  :ensure t
  :after haskell-mode
  :config
  (setq lsp-haskell-server-path "haskell-language-server-9.4.2\~1.8.0.0"
        lsp-haskell-liquid-on t
        lsp-haskell-fomatting-provider "stylish-haskell"))

(setq haskell-font-lock-symbols t)

(add-to-list 'load-path "~/.config/haskmacs/ghcid")
(require 'ghcid)

;; (use-package python-mode
;;   :ensure t)

(use-package json-mode
  :ensure t)

(use-package yaml-mode
  :ensure t)

(use-package csv-mode
  :ensure t)

(use-package tex-mode
  :ensure t)

(use-package markdown-mode
  :ensure t)
